src/Documents/НачислениеЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>НачислениеЗарплаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УчетЗатрат</xr:Item>
				<xr:Item>CalculationRegister.Начисления</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрафикРаботы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательРасчета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/КадроваяИсторияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КадроваяИсторияСотрудников</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Работает</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/НачислениеЗарплаты/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

//  - Структура
//      * ВидыРасчетов - Структура
&НаКлиенте
Перем _ДополнительныеСвойства;

#КонецОбласти // ОписаниеПеременных

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(_)
    инициализация();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(_)
    ЭтотОбъект.Объект.Начисления.Очистить();
    началоПериода = НачалоМесяца(ЭтотОбъект.Объект.ПериодНачисления);
    конецПериода = КонецМесяца(ЭтотОбъект.Объект.ПериодНачисления);

    заполнитьТаблицуНачисленийНаСервере(началоПериода, конецПериода);

    ЭтотОбъект.Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область ОбработчикиСобытийЭлементовТаблицыФормыНачисления

&НаКлиенте
Процедура НачисленияПриНачалеРедактирования(Знач тчНачисления, Знач новаяСтрока, Знач копирование)
    текущиеДанныеНачисления = тчНачисления.ТекущиеДанные;
    Если новаяСтрока И копирование = Ложь И ЗначениеЗаполнено(текущиеДанныеНачисления.ВидРасчета) = Ложь Тогда
        текущиеДанныеНачисления.ВидРасчета = _ДополнительныеСвойства.ВидыРасчетов.Оклад;
    КонецЕсли;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыНачисления

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура заполнитьТаблицуНачисленийНаСервере(Знач началоПериода, Знач конецПериода)
    параметрыЗапроса = Новый Структура("НачалоПериода, КонецПериода",
            началоПериода, конецПериода);
    кадроваяИсторияСотрудников = РегистрыСведений.КадроваяИсторияСотрудников.ПолучитьКадровыеДанныеИнтервал(
            Неопределено, параметрыЗапроса, Истина);

    Если кадроваяИсторияСотрудников = Неопределено Тогда
        сообщение = Новый СообщениеПользователю;
        сообщение.Текст = "Кадровая история за период начисления отсутствует.";
        сообщение.Сообщить();

        Возврат; // Выход
    КонецЕсли;

    предСтрока = Неопределено;
    Для Каждого данныеСотрудника Из кадроваяИсторияСотрудников Цикл
        строкаНачисления = Объект.Начисления.Добавить();

        строкаНачисления.ВидРасчета = ПланыВидовРасчета.Начисления.Оклад;
        строкаНачисления.Сотрудник = данныеСотрудника.Сотрудник;
        строкаНачисления.ГрафикРаботы = данныеСотрудника.ГрафикРаботы;
        строкаНачисления.ДатаНачала = Макс(началоПериода, данныеСотрудника.Период);
        строкаНачисления.ДатаОкончания = ?(данныеСотрудника.Работает, конецПериода, данныеСотрудника.Период);
        строкаНачисления.ПоказательРасчета = данныеСотрудника.Оклад;

        // Если кадровая история по сотруднику менялась в течении текущего периода
        Если предСтрока <> Неопределено И предСтрока.Сотрудник = данныеСотрудника.Сотрудник Тогда
            Если данныеСотрудника.Работает Тогда
                предСтрока.ДатаОкончания = получитьПредыдущийДеньНаСервере(строкаНачисления.ДатаНачала);

                // Обработка особого случая увольнения сотрудника, когда кадровая история менялась
                //  в текущем периоде (в том-же периоде когда и увольнение).
                //  пример: если сотрудник устроился и уволился в течении одного месяца
            Иначе
                предСтрока.ДатаОкончания = строкаНачисления.ДатаНачала;
                Объект.Начисления.Удалить(Объект.Начисления.Количество() - 1);

                Продолжить;
            КонецЕсли;
        КонецЕсли;

        предСтрока = строкаНачисления;
    КонецЦикла;
КонецПроцедуры

// Устарела. Нужно доработать с учетом графика работы
//  Отнимает одни сутки от переданной в аргументе `даты`
// Параметры:
//  дата - Дата
// Возвращаемое значение:
//  - Дата
&НаСервереБезКонтекста
Функция получитьПредыдущийДеньНаСервере(Знач дата)
    Возврат дата - 24 * 60 * 60;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции

#Область Инициализация

&НаКлиенте
Процедура инициализация()
    _ДополнительныеСвойства = Новый Структура("ВидыРасчетов");
    _ДополнительныеСвойства.ВидыРасчетов = получитьПредопределенныеДанныеНаСервере().ВидыРасчетов;
КонецПроцедуры

&НаСервереБезКонтекста
Функция получитьПредопределенныеДанныеНаСервере()
    результат = Новый Структура;
    результат.Вставить("ВидыРасчетов", РаботаСМетаданными.ПолучитьЗначенияПредопределенных(Тип("ПланВидовРасчетаСсылка.Начисления")));
    ДиагностикаКлиентСервер.Утверждение(
        ПроверкаТиповКлиентСервер.ЭтоСтруктура(результат.ВидыРасчетов, Ложь));

    // Если предопределенное значение Оклад отсутствует, тогда делаем замену на пустую ссылку
    //  это значение будет использоваться как значение по умолчанию при интерактивном добавлении новой строки начислений
    Если результат.ВидыРасчетов.Свойство("Оклад") = Ложь Тогда
        результат.ВидыРасчетов = Новый Структура(результат.ВидыРасчетов);
        результат.ВидыРасчетов.Вставить("Оклад", ПланыВидовРасчета.Начисления.ПустаяСсылка());
        результат.ВидыРасчетов = Новый ФиксированнаяСтруктура(результат.ВидыРасчетов);
    КонецЕсли;

    Возврат Новый ФиксированнаяСтруктура(результат);
КонецФункции

#КонецОбласти // Инициализация
